Revit 2024 API
TableSectionData.GetCellCategoryId Method (Int32)
 Returns a column's ParamId Associated with the paramId to find the correct element
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementId GetCellCategoryId(
	int nCol
)
Visual Basic
Public Function GetCellCategoryId ( _
	nCol As Integer _
) As ElementId
Visual C++
public:
ElementId^ GetCellCategoryId(
	int nCol
)
Parameters
nCol
Type: System.Int32
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given column number nCol is invalid.
See Also
TableSectionData Class
GetCellCategoryId Overload
Autodesk.Revit.DB Namespace